Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Do not step &into the classes
zh_cn: 不步入类(&I)

source: Do not suggest 'toList()' or 'toSet()' collectors
zh_cn: 不建议 'toList()' 或 'toSet()' 的 collectors

source: Do not warn when content is non-constant
zh_cn: 当内容不是常量时不警告

source: Do not wrap
zh_cn: 不换行

source: Do not wrap one line comments
zh_cn: 单行注释不换行

source: Do you really want to replace old library ''{0}''?
zh_cn: 你真的想替换旧的库 ''{0}'' 吗？

source: Do you really want to uninstall plugin ''{0}''?
zh_cn: 你真的要卸载插件 ''{0}'' 吗?

source: Do you really want to uninstall these {0} plugins ?
zh_cn: 你真的要卸载这些 {0} 插件吗?

source: Do you trust ''{1}''?
zh_cn: 你信任 ''{1}'' 吗？

source: Do you trust this location?
zh_cn: 你信任这个地点吗？

source: Do you want to add exceptions to method signatures in the whole method hierarchy?
zh_cn: 要在整个方法层次结构中添加异常到方法签名吗？

source: Do you want to change inheritors' visibility to visibility of the base method?
zh_cn: 要将继承者的可见性更改为基本方法的可见性吗？

source: Do you want to clean quarantined status for this folder?
zh_cn: 要清除此文件夹的隔离状态吗？

source: Do you want to clean quarantined status?
zh_cn: 您要清除隔离状态吗？

source: Do you want to compile the project before continuing DSM analysis?
zh_cn: 你要在 DSM 分析之前继续编译项目吗？

source: Do you want to continue?
zh_cn: 你想继续吗？

source: Do you want to continue?</body></html>
zh_cn: 你想继续吗？</body></html>

source: Do you want to convert it?
zh_cn: 你要转换吗？

source: Do you want to create a project with no SDK assigned?
zh_cn: 要创建没有分配 SDK 的项目吗？

source: Do you want to create it?
zh_cn: 你想创建它吗？

source: Do you want to delete all already unshelved changelists?
zh_cn: 是否要删除所有已经取消搁置的更改列表？

source: Do you want to delete multiple parameters?
zh_cn: 要删除多个参数吗？

source: Do you want to delete multiple type parameters?
zh_cn: 要删除多个类型的参数吗？

source: Do you want to delete the external tool(s)?
zh_cn: 您想删除外部工具吗?

source: Do you want to delete the keymap?
zh_cn: 要删除快捷键映射吗?

source: Do you want to delete them and proceed?
zh_cn: 要删除它们并继续吗？

source: Do you want to disconnect from the process ''{0}''?
zh_cn: 是否要断开与进程 ''{0}'' 的连接?

source: Do you want to display coverage data for ''{0}''?
zh_cn: 要显示 ''{0}'' 的覆盖率数据吗？

source: Do you want to edit profile assignments on them?</html>
zh_cn: 你想为他们编辑配置文件分配吗？</html>

source: Do you want to open the existing project or delete it and import ''{2}''?
zh_cn: 是否要打开现有项目或将其删除并导入 ''{2}''?

source: Do you want to overwrite it?
zh_cn: 你要覆盖吗？

source: Do you want to proceed without it?
zh_cn: 你要没有它也继续吗？

source: Do you want to proceed?
zh_cn: 你想继续吗？

source: Do you want to process overriding methods with covariant return type?
zh_cn: 是否要处理覆盖方法 具有协变返回类型？?

source: Do you want to remove ''{0}'' coverage data?
zh_cn: 你要移除 ''{0}'' 覆盖率数据吗?

source: Do you want to remove other assignments?
zh_cn: 要移除其他的分配吗？

source: Do you want to remove the reference to {0}?
zh_cn: 是否要移除该引用吗？ {0}

source: Do you want to rename the whole package or directory {0} only?
zh_cn: 你想要重命名整个包或目录吗？ 只 {0} ?

source: Do you want to rename {2} instead?
zh_cn: 你想重命名 {2} 吗？

source: Do you want to replace it?
zh_cn: 你想替换它吗？

source: Do you want to replace this occurrence?
zh_cn: 你要替换这个匹配项吗?

source: Do you want to save scope as shared?
zh_cn: 是否要将范围保存为共享?

source: Do you want to save selected IDE profile as project profile?
zh_cn: 你想保存选定的 IDE 配置文件作为项目配置文件?

source: Do you want to save the current scheme?
zh_cn: 你想保存当前的方案吗？

source: Do you want to schedule the following file for addition to VCS?
zh_cn: 要安排以下文件以添加到 VCS 吗？

source: Do you want to search for accessors of ''{0}''?
zh_cn: 你想搜索 ''{0}'' 的访问器吗?

source: Do you want to search for the {2} usages instead?
zh_cn: 你要搜索 {2} 用法吗？

source: Do you want to search usages of parameter ''{0}'' in overriding methods?
zh_cn: 要在覆盖方法中搜索参数 ''{0}'' 的使法吗？

source: Do you want to terminate the process ''{0}''?
zh_cn: 你想终止 ''{0}'' 进程吗?

source: Do you want to try again?
zh_cn: 你想重试吗？

source: Do you want {0} the base {1,choice,1#method|2#methods}?
zh_cn: 你想要 {0} base 的方法吗?

source: Do you wish to continue?
zh_cn: 你要继续吗?

source: Do you wish to ignore them and continue?
zh_cn: 要忽略它们并继续吗?

source: Dock/undock active tool window
zh_cn: 停靠/分离活动工具窗口

source: Dock_ed Mode
zh_cn: 停靠模式(_E)

source: Document these tags
zh_cn: 为这些标签生成文档

source: Documentation
zh_cn: 文档

source: Documentation Paths
zh_cn: 文档路径

source: Documentation URLs
zh_cn: 文档 URL

source: Documentation comments
zh_cn: 文档注释

source: Documentation for {0}
zh_cn: 文档为 {0}

source: Don't Share
zh_cn: 不分享

source: Don't Show
zh_cn: 不显示

source: Don't Show Again
zh_cn: 不再显示

source: Don't break if inline content:
zh_cn: 不要中断内联内容:

source: Don't report Optional.get() calls without previous isPresent check
zh_cn: 不要报告 Optional.get() 在 isPresent 检查前调用

source: Don't report always true assertions
zh_cn: 不要报告总是 true 的断言

source: Don't report assertions with condition statically proven to be always <code>true</code>
zh_cn: 不要报告条件静态证明总是 <code>true</code> 的断言

source: Don't report nullable methods which always return not-null value
zh_cn: 不要报告 nullable 的方法总是返回非空值

source: Don't report values which are guaranteed to be constant
zh_cn: 不要报告被保证为常量的值。

source: Don't show again
zh_cn: 不再显示

source: Don't suggest to replace with 'do while'
zh_cn: 不要建议用 'do while' 替换

source: Don't warn if length of replacement bigger than original
zh_cn: 不要警告如果替换的长度比原来的更大

source: Done.
zh_cn: 完成。

source: Done:
zh_cn: 完成:

source: Done: {0}
zh_cn: 完成: {0}

source: Dont Wrap If Inline Content Only
zh_cn: 如果只有内联内容不要换行

source: Dot, space and some other keys will also close this lookup and be inserted into editor
zh_cn: 点，空格和其他一些键也将关闭此查找并插入编辑器

source: Dotted Line
zh_cn: 虚线

source: Double Click
zh_cn: 双击

source: Double Click is not supported for Button {0}
zh_cn: 按钮 {0} 不支持双击

source: Double quoted string
zh_cn: 双引号的字符串

source: Double-click to see)
zh_cn: 双击查看)

source: Down
zh_cn: 下

source: Down the stack trace
zh_cn: 向下堆栈跟踪

source: Down with Selection
zh_cn: 向下选中

source: Download Directory
zh_cn: 下载目录

source: Download and Install
zh_cn: 下载并安装

source: Downloaded files will be copied to selected directory
zh_cn: 下载的文件将被复制到选定的目录

source: Downloaded libraries will be copied to selected directory
zh_cn: 下载的库将被复制到选定的目录

source: Downloading ''{0}'' from ''{1}''...
zh_cn: 从 ''{1}'' 下载 ''{0}''...

source: Downloading ''{0}''...
zh_cn: 下载中 ''{0}''...

source: Downloading Patch File
zh_cn: 下载补丁文件

source: Downloading Plugin Updates
zh_cn: 下载插件更新

source: Downloading Plugins
zh_cn: 下载插件

source: Downloading list of plugins from {0}
zh_cn: 从 {0} 下载插件列表

source: Downloading plugin ''{0}''
zh_cn: 下载插件 ''{0}''

source: Downloading {0}
zh_cn: 下载中 {0}

source: Downloading {0} {0, choice, 1#file|2#files}...
zh_cn: 下载 {0} 个文件...

source: Downloads
zh_cn: 下载

source: Drag to the editor area
zh_cn: 拖动到编辑器区域

source: Draw border
zh_cn: 绘制边界

source: Drop An Error
zh_cn: 丢弃一个错误

source: Drop An OutOfMemoryError
zh_cn: 丢弃一个内存溢出错误

source: Drop _Frame
zh_cn: 丢帧(_F)

source: Drop an OutOfMemoryError in Metaspace
zh_cn: 在 Metaspace 中删除 OutOfMemoryError

source: Due to the following errors: {1}
zh_cn: 由于下列错误: {1}

source: Dummy
zh_cn: 虚拟的

source: Dump Inspection Descriptions
zh_cn: 转储检验描述

source: Dump Intentions Descriptions
zh_cn: 转储检验描述

source: Dump Threads
zh_cn: 转储线程

source: Dump what is cached in PSI
zh_cn: 转储 PSI 缓存

source: Dumping XML...
zh_cn: 转储 XML...

source: Duplicate &keys
zh_cn: 重复键(&K)

source: Duplicate &values
zh_cn: 重复值(&V)

source: Duplicate ''exports'' target: {0}
zh_cn: 重复的 ''exports'' 目标: {0}

source: Duplicate ''exports'': {0}
zh_cn: 重复的 ''exports'': {0}

source: Duplicate ''opens'' target: {0}
zh_cn: 重复的 ''opens'' 目标: {0}

source: Duplicate ''opens'': {0}
zh_cn: 重复的 ''opens'': {0}

source: Duplicate ''provides'': {0}
zh_cn: 重复的 ''provides'': {0}

source: Duplicate ''requires'': {0}
zh_cn: 重复的 ''requires'': {0}

source: Duplicate ''uses'': {0}
zh_cn: 重复的 ''uses'': {0}

source: Duplicate @param tag for parameter ''{0}''
zh_cn: 参数 ''{0}'' 重复的 @param 标签

source: Duplicate @throws or @exception tag for exception ''{0}''
zh_cn: 异常 ''{0}'' 重复的 @throws 或 @exception 标签

source: Duplicate @{0} tag
zh_cn: 重复的 @{0} 标签

source: Duplicate Code Style Scheme As
zh_cn: 重复代码样式方案为

source: Duplicate Color Scheme As
zh_cn: 重复颜色方案为

source: Duplicate Entire Lines
zh_cn: 重复整行

source: Duplicate ID
zh_cn: 重复的 ID

source: Duplicate Line or Selection
zh_cn: 重复行或选中区域

source: Duplicate Map key
zh_cn: 重复的 Map 键

source: Duplicate Property
zh_cn: 重复属性

source: Duplicate Property Key ''{0}'' #treeend With Values:<br>
zh_cn: 重复的属性键 ''{0}''#treeend 有值:<br>

source: Duplicate Property Key ''{0}'' With Different Values #treeend :<br>
zh_cn: 重复的属性键 ''{0}'' 有不同的值 #treeend :<br>

source: Duplicate Property Value ''{0}'' #treeend With Keys:<br>
zh_cn: 重复的属性值 ''{0}''#treeend 有键:<br>

source: Duplicate Set element
zh_cn: 重复的 Set 元素

source: Duplicate String Literal
zh_cn: 重复字符串文字

source: Duplicate Watch
zh_cn: 复制观察点

source: Duplicate annotation
zh_cn: 重复注解

source: Duplicate annotation.
zh_cn: 重复注解。

source: Duplicate attribute ''{0}''
zh_cn: 重复属性 ''{0}''

source: Duplicate attribute {0}
zh_cn: 重复属性 {0}

source: Duplicate class found in the file ''{0}''
zh_cn: 在文件 ''{0}'' 中找到重复的类

source: Duplicate class: ''{0}''
zh_cn: 重复类：''{0}''

source: Duplicate default label
zh_cn: 重复的 default 标签

source: Duplicate id reference
zh_cn: 重复的 id 引用

source: Duplicate implementation: {0}
zh_cn: 重复的实现: {0}

source: Duplicate label ''{0}''
zh_cn: 重复标签 ''{0}''

source: Duplicate module name ''{0}''
zh_cn: 重复的模块名称 ''{0}''

source: Duplicate plugin id:
zh_cn: 重复的插件 ID:

source: Duplicate string literal
zh_cn: 重复的字符串

source: Duplicate targets
zh_cn: 重复目标

source: Duplicate targets in imported files
zh_cn: 导入文件中的重复目标

source: Duplicate throws
zh_cn: 复制的 throws

source: Duplicate type parameter: ''{0}''
zh_cn: 重复类型参数：''{0}''

source: Duplicate...
zh_cn: 重复...

source: Duplicated Code
zh_cn: 重复的代码

source: Duplicated rules will be ignored.
zh_cn: 重复的规则将被忽略。

source: Duplicates
zh_cn: 重复

source: Duplicates cannot proceed
zh_cn: 重复无法继续

source: Duplicates cannot proceed.
zh_cn: 重复无法继续。

source: Duplicates for ''{0}''
zh_cn: 重复的 ''{0}''

source: During the debugging session, switch to the Debugger Console, and then press the very lowest button in its toolbar.
zh_cn: 在调试会话期间，切换到调试器控制台，然后按工具栏中最下面的按钮。

source: During your project conversion, the following problem(s) were detected:
zh_cn: 在项目转换期间，检测到以下问题：

source: E&dit Variables...
zh_cn: 编辑变量...(&D)

source: E&dit variables...
zh_cn: 编辑变量...(&D)

source: E&dit...
zh_cn: 编辑...(&D)

source: E&ntire scope
zh_cn: 整个范围(&N)

source: E&valuate
zh_cn: 计算(&V)

source: E&xisting Changelist
zh_cn: 现有的更改列表(&X)

source: E&xisting Templates...
zh_cn: 现有模板...(&X)

source: E&xpand with
zh_cn: 展开(&X)

source: E&xtract {0}
zh_cn: 提取 {0}(&X)

source: E-mail:
zh_cn: 电子邮件:

source: EAP builds can only be updated from the EAP channel
zh_cn: EAP 构建只能从 EAP 通道更新

source: ERROR
zh_cn: 错误

source: E_rror Description
zh_cn: 错误描述(_R)

source: E_xit
zh_cn: 退出(_X)

source: E_xpand
zh_cn: 展开(_X)

source: E_xternal Documentation
zh_cn: 外部文档(_X)

source: E_xtract
zh_cn: 提取(_X)

source: Each antivirus check in your project consumes resources.
zh_cn: 项目中的每个防病毒检查都会消耗资源。

source: Each line in the text below corresponds to a module.
zh_cn: 以下文本中的每一行对应于一个模块。

source: Each resource pattern may contain the following wildcards: ?
zh_cn: 每个资源的模式可能包含以下通配符： ?

source: Early Access Java versions may cause compatibility issues.
zh_cn: Early Access Java 版本可能会导致兼容性问题。

source: Eclipse Options
zh_cn: Eclipse 选项

source: Ed&it...
zh_cn: 编辑...(&I)

source: Ed_it Scopes
zh_cn: 编辑范围(_I)

source: Edi&t...
zh_cn: 编辑...(&T)

source: Edit
zh_cn: 编辑

source: Edit &Global Settings
zh_cn: 编辑全局设置(&G)

source: Edit ''{0}'' Options
zh_cn: 编辑 ''{0}'' 选项

source: Edit Action &Icon...
zh_cn: 编辑操作图标...(&I)

source: Edit Additional Javadoc Tags
zh_cn: 编辑额外的 JavaDoc 标签

source: Edit Additional Not Required Html Attributes
zh_cn: 编辑额外的非必须的 HTML 属性

source: Edit Changelist
zh_cn: 编辑更改列表

source: Edit Changelist...
zh_cn: 编辑更改列表...

source: Edit Class/Package Migration Description
zh_cn: 编辑 类/包 迁移说明

source: Edit Code Actions
zh_cn: 编辑代码操作

source: Edit Configu_rations...
zh_cn: 编辑配置...(_R)

source: Edit Configuration
zh_cn: 编辑配置

source: Edit Custom Properties...
zh_cn: 编辑自定义属性...

source: Edit Custom VM Options
zh_cn: 编辑自定义 VM 选项

source: Edit Custom VM Options...
zh_cn: 编辑自定义 VM 选项...

source: Edit Defaults
zh_cn: 编辑默认值

source: Edit Dependency Rules
zh_cn: 编辑依赖规则

source: Edit Description
zh_cn: 编辑说明

source: Edit Errors
zh_cn: 编辑错误

source: Edit File Template
zh_cn: 编辑文件模板

source: Edit File Templates...
zh_cn: 编辑文件模板...

source: Edit File Type
zh_cn: 编辑文件类型

source: Edit Files
zh_cn: 编辑文件

source: Edit Filter
zh_cn: 编辑过滤器

source: Edit Filters
zh_cn: 编辑过滤器

source: Edit Global Settings...
zh_cn: 编辑全局设置...

source: Edit Groovy Script Constraint
zh_cn: 编辑 Groovy 脚本约束

source: Edit Group of Names
zh_cn: 编辑组名称

source: Edit I18n template
zh_cn: 编辑国际化模板

source: Edit Interceptor ''{0}'' bindings
zh_cn: 编辑拦截器 ''{0}'' 的绑定

source: Edit Issue Navigation Link
zh_cn: 编辑问题导航链接

source: Edit Keyword
zh_cn: 编辑关键字

source: Edit Live Template
zh_cn: 编辑代码模板

source: Edit Log Files Aliases
zh_cn: 编辑日志文件别名

source: Edit Macros
zh_cn: 编辑宏

source: Edit Migration Map
zh_cn: 编辑迁移地图

source: Edit Pattern
zh_cn: 编辑模式

source: Edit Quick List
zh_cn: 编辑快速列表

source: Edit Repository
zh_cn: 编辑仓库

source: Edit Root Properties
zh_cn: 编辑根属性

source: Edit Rules
zh_cn: 编辑规则

source: Edit Run Configuration
zh_cn: 编辑运行配置

source: Edit Scopes
zh_cn: 编辑范围

source: Edit Settings
zh_cn: 编辑设置

source: Edit Settings|Colors \& Fonts
zh_cn: 编辑 设置|颜色 \& 字体

source: Edit Source
zh_cn: 编辑源码

source: Edit Template Variables
zh_cn: 编辑模板变量

source: Edit Tool
zh_cn: 编辑工具

source: Edit VCS Directory Mapping
zh_cn: 编辑 VCS 目录映射

source: Edit Variable
zh_cn: 编辑变量

source: Edit Variables
zh_cn: 编辑变量

source: Edit Watch
zh_cn: 编辑观察点

source: Edit Wildcard
zh_cn: 编辑通配符

source: Edit application preferences
zh_cn: 编辑应用程序首选项

source: Edit application settings
zh_cn: 编辑应用程序设置

source: Edit breakpoint
zh_cn: 编辑断点

source: Edit custom attributes
zh_cn: 编辑自定义属性

source: Edit custom boolean attributes
zh_cn: 编辑自定义布尔属性

source: Edit custom tags
zh_cn: 编辑自定义标签

source: Edit defaults settings
zh_cn: 编辑默认值设置

source: Edit dependency rule "{0} "
zh_cn: 编辑依赖规则 "{0}"

source: Edit dependency rules
zh_cn: 编辑依赖规则

source: Edit filter
zh_cn: 编辑过滤器

source: Edit inspection profile setting
zh_cn: 编辑检查配置文件设置

source: Edit name and description of selected changelist
zh_cn: 编辑选中更改列表的名称和描述

source: Edit options of reporter inspection
zh_cn: 编辑报告者检查选项

source: Edit properties
zh_cn: 编辑属性

source: Edit rule
zh_cn: 编辑规则

source: Edit selected arrangement rule
zh_cn: 编辑选定的排列规则

source: Edit source
zh_cn: 编辑源码

source: Edit template...
zh_cn: 编辑模板...

source: Edit...
zh_cn: 编辑...

source: EditFrameSource
zh_cn: 编辑框架源码

source: EditNodeSource
zh_cn: 编辑节点源码

source: Editor
zh_cn: 编辑器

source: Editor Actions
zh_cn: 编辑器操作

source: Editor Close Actions
zh_cn: 编辑器关闭操作

source: Editor Colors
zh_cn: 编辑器颜色

source: Editor Create/Delete Actions
zh_cn: 编辑器创建/删除操作

source: Editor Font
zh_cn: 编辑器字体

source: Editor Gutter Popup Menu
zh_cn: 编辑器 Gutter 弹出菜单

source: Editor Gutter//Added lines
zh_cn: 编辑器 Gutter//添加的行

source: Editor Gutter//Border
zh_cn: 编辑器 Gutter//边框

source: Editor Gutter//Deleted lines
zh_cn: 编辑器 Gutter//删除的行

source: Editor Gutter//Modified lines
zh_cn: 编辑器 Gutter//修改的行

source: Editor Gutter//Whitespace-modified lines
zh_cn: 编辑器 Gutter//修改了空白的行

source: Editor Popup Menu
zh_cn: 编辑窗口弹出菜单

source: Editor Popup Menu Actions (1)
zh_cn: 编辑器弹出菜单操作(1)

source: Editor Popup Menu Actions (2)
zh_cn: 编辑器弹出菜单操作(2)

source: Editor Select Actions
zh_cn: 编辑器选择的操作

source: Editor Settings
zh_cn: 编辑器设置

source: Editor Tab Popup Menu
zh_cn: 编辑器选项卡弹出菜单

source: Editor Tab Popup Menu Actions (1)
zh_cn: 编辑选项卡弹出菜单操作(1)

source: Editor _Tabs
zh_cn: 编辑器选项卡(_T)

source: Editor delete line
zh_cn: 编辑器删除行

source: Editor incremental search
zh_cn: 编辑器增量搜索

source: Editor menu
zh_cn: 编辑菜单

source: Editor {0}
zh_cn: 编辑 {0}

source: Editor//Bookmarks
zh_cn: 编辑器//书签

source: Editor//Breadcrumbs//Current
zh_cn: 编辑器//面包屑导航//当前

source: Editor//Breadcrumbs//Default
zh_cn: 编辑器//面包屑导航//默认

source: Editor//Breadcrumbs//Hovered
zh_cn: 编辑器//面包屑导航//悬停

source: Editor//Breadcrumbs//Inactive
zh_cn: 编辑器//面包屑导航//未激活

source: Editor//Caret
zh_cn: 编辑器//插入符

source: Editor//Caret row
zh_cn: 编辑器//插入符所在行

source: Editor//Guides//Hard wrap guide
zh_cn: 编辑器//指导//硬换行指导

source: Editor//Guides//Indent guide
zh_cn: 编辑器//指导//缩进指导

source: Editor//Guides//Indent guide selected
zh_cn: 编辑器//指导//所选缩进指导

source: Editor//Guides//Visual guides
zh_cn: 编辑器//指导//可视化指导

source: Editor//Gutter background
zh_cn: 编辑器//Gutter 背景

source: Editor//Notification background
zh_cn: 编辑器//通知背景

source: Editor//Right margin
zh_cn: 编辑器//右边距

source: Editor//Selection background
zh_cn: 编辑器//选中项背景

source: Editor//Selection foreground
zh_cn: 编辑器//选中项前景

source: Editor//Separator line above
zh_cn: 编辑器//分隔线上方

source: Editor//Separator line below
zh_cn: 编辑器//分隔线下方

source: Editor//Tear line
zh_cn: 编辑器//分隔线

source: Editor//Tear line selection
zh_cn: 编辑器//选择项分隔线

source: Editor:
zh_cn: 编辑器:

source: Effects
zh_cn: 效果

source: Either 'name' or 'ref' attribute should present
zh_cn: 应该出现 'name' 或 'ref' 属性

source: Element ''{0}'' is undefined
zh_cn: 元素 ''{0}'' 未定义

source: Element \&lt;#ref\&gt; is missing an end tag
zh_cn: 元素 \&lt;#ref\&gt; 缺少结束标签

source: Element is not closed
zh_cn: 元素未关闭

source: Element name:
zh_cn: 元素名称:

source: Element type is not compatible with array type
zh_cn: 元素类型与数组类型不兼容

source: Element {0} doesn''t have required attribute {1}
zh_cn: 元素 {0} 没有需要的属性 {1}

source: Element {0} is not allowed here
zh_cn: 元素 {0} 不允许在这里

source: Element {0} is not closed
zh_cn: 元素 {0} 未关闭

source: Element {0} must be declared
zh_cn: 元素 {0} 必须声明

source: Elements to Delete
zh_cn: 删除元素

source: Eliminate duplicates
zh_cn: 消除重复

source: Em&ulated
zh_cn: 模拟(&U)

source: Emacs Tab
zh_cn: Emacs 选项卡

source: Empty
zh_cn: 空

source: Empty Library
zh_cn: 空库

source: Empty Project
zh_cn: 空项目

source: Empty array initializer braces
zh_cn: 空数组初始化大括号

source: Empty attribute {0} is not allowed
zh_cn: 空属性 {0} 不允许

source: Empty character literal
zh_cn: 空字符文字

source: Empty file mask
zh_cn: 空文件掩码

source: Empty method
zh_cn: 空方法

source: Empty method call parentheses
zh_cn: 空方法调用括号

source: Empty method declaration parentheses
zh_cn: 空方法声明括号

source: Empty method overrides empty method
zh_cn: 空方法重写空方法

source: Empty module names aren't allowed
zh_cn: 不允许空模块名

source: Empty project
zh_cn: 空项目

source: Empty tag
zh_cn: 空标签

source: Empty tag doesn't work in some browsers
zh_cn: 空标签在一些浏览器中无效

source: Empty test suite
zh_cn: 空测试套件

source: Empty test suite.
zh_cn: 空测试套件。

source: Enable
zh_cn: 启用

source: Enable &Live Templates
zh_cn: 启用代码模板(&L)

source: Enable &abbreviation preview
zh_cn: 启用缩写预览(&A)

source: Enable ''{0}''
zh_cn: 启用 ''{0}''

source: Enable 'JVM will hang' warning
zh_cn: 启用 'JVM 将挂起' 警告

source: Enable 'Settings|Code Style|Imports|Optimize imports on the fly'
zh_cn: 启用 '设置 | 代码样式 | 导入 | 快速优化导入'

source: Enable 't&oString()' object view:
zh_cn: 启用 'toString()' 对象视图:(&O)

source: Enable JavaDoc formatting
zh_cn: 启用 JavaDoc 格式化

source: Enable Memory View
zh_cn: 启用内存视图

source: Enable Parameter Name Hints
zh_cn: 启用参数名称提示

source: Enable RMI stubs generation
zh_cn: 启用 RMI 存根生成

source: Enable UI forms compilation (requires "javac2" ant task from IDEA distribution)
zh_cn: 启用 UI 形式编译 (需要从 IDEA 分配 "javac2" Ant 任务)

source: Enable Version Control Integration
zh_cn: 启用版本控制集成

source: Enable alternative view for Coll&ections classes
zh_cn: 为集合类启用可选视图(&E)

source: Enable and Restart
zh_cn: 启用并重新启动

source: Enable auto expressions in Variables view
zh_cn: 在变量视图中启用自动表达式

source: Enable automatic &URL recognition while wrapping text with <a> tag
zh_cn: 在使用<a>标签包装文本时启用自动 URL 识别(&U)

source: Enable background processes
zh_cn: 启用后台进程

source: Enable breakpoint
zh_cn: 启用断点

source: Enable font ligatures
zh_cn: 启用字体连字

source: Enable formatter markers in comments
zh_cn: 在注释中启用格式化程序标记

source: Enable in-place mode
zh_cn: 启用 in-place 模式

source: Enable leading asterisks
zh_cn: 启用前导星号

source: Enable or disable additional log categories.
zh_cn: 启用或禁用额外的日志类别。

source: Enable particle valid (restriction) rule
zh_cn: 启用粒子有效(限制)规则

source: Enable regular expressions in formatter markers
zh_cn: 在格式化标记中启用正则表达式

source: Enable restriction check
zh_cn: 启用限制检查

source: Enable the horizontal scrolling with the mouse wheel by holding the Shift key.
zh_cn: 按住 Shift 键滚动鼠标滚轮可以启用水平滚动。

source: Enable this feature in the Live Edit page of the Settings dialog, or check the command Live Edit in the View menu:
zh_cn: 在 Settings 对话框的 Live Edit 页启用该功能，或者在 View 菜单中选择 Live Edit 命令：

source: Enable this framework in the Emmet(Zen Coding) page of the Settings dialog:
zh_cn: 在 Settings 对话框中的 Emmet(Zen Coding) 页启用此框架：

source: Enable this framework in the CSS or HTML pages under the Emmet(Zen Coding) node of the Settings/Preferences dialog:
zh_cn: 在 Settings/Preferences 对话框中 Emmet(Zen Coding) 节点下的 CSS 或 HTML 页启用此框架：

source: Enable this framework in the corresponding page of the Editor | Emmet node (Settings/Preferences):
zh_cn: 在 Editor | Emmet (Settings/Preferences) 节点下相应的页面启用此框架：

source: Enable unique check
zh_cn: 启用唯一检查

source: Enable unique particle rule
zh_cn: 启用唯一粒子规则

source: Enable&d
zh_cn: 启用(&D)

source: Enable/disable breakpoint at the current line
zh_cn: 启用/禁用当前行的断点

source: Enable:
zh_cn: 启用:

source: Enabled
zh_cn: 启用

source: Enables watching last executed method return value
zh_cn: 允许观察最后执行的方法返回值

source: Encapsulate
zh_cn: 封装

source: Encapsulate Fields
zh_cn: 封装字段

source: Encapsulate field
zh_cn: 封装字段

source: Encapsulate fields refactoring cannot be applied to interface
zh_cn: 封装字段重构不能应用于接口

source: Encapsulated Fields' Visibility
zh_cn: 封装字段的可见性

source: Encapsulating fields in {0}
zh_cn: 封装字段在 {0}

source: Encapsulation
zh_cn: 封装

source: Encapsulation issues
zh_cn: 封装问题

source: Encodings are not configured
zh_cn: 未配置编码

source: End (on blank line)
zh_cn: End(在空行)

source: End index is less than start index
zh_cn: 结束索引小于开始索引

source: End of line
zh_cn: 行尾

source: End tag:\&nbsp;could be omitted
zh_cn: 结束标签:\&nbsp;可以省略

source: Enforce on format
zh_cn: 强制格式化

source: Ensure right margin is not exceeded
zh_cn: 确保不超过右边距

source: Enter
zh_cn: 回车

source: Enter Distraction Free Mode
zh_cn: 进入免打扰模式

source: Enter Exception Class
zh_cn: 输入异常类

source: Enter Full Screen
zh_cn: 进入全屏

source: Enter Macro Name
zh_cn: 输入宏的名称

source: Enter New Name
zh_cn: 输入新名称

source: Enter Presentation Mode
zh_cn: 进入演示模式

source: Enter Presentation mode
zh_cn: 进入演示模式

source: Enter a comma-separated list of names:
zh_cn: 输入逗号分隔的名称列表：

source: Enter a file name to create a new {0} {1}
zh_cn: 输入文件名以创建新的 {0} {1}

source: Enter a new @interface name:
zh_cn: 输入一个 @interface 的新名称:

source: Enter a new class name:
zh_cn: 输入一个新的类名:

source: Enter a new file name:
zh_cn: 输入一个新的文件名:

source: Enter a new folder name:
zh_cn: 输入一个新的文件夹名称:

source: Enter a new interface name:
zh_cn: 输入一个新的接口名称:

source: Enter a new package name:
zh_cn: 输入新的包名称:

source: Enter a short abbreviation of a template and press Tab or Enter.
zh_cn: 输入模板的缩写，然后按 Tab 或 Enter。

source: Enter action or option name:
zh_cn: 输入操作或选项名称：

source: Enter class name:
zh_cn: 输入类名:

source: Enter documentation URL:
zh_cn: 输入文档 URL：

source: Enter file name:
zh_cn: 输入文件名:

source: Enter inspection name:
zh_cn: 输入检查名称:

source: Enter instance ID:
zh_cn: 输入实例 ID:

source: Enter license &data
zh_cn: 输入许可证数据(&D)

source: Enter license &server address
zh_cn: 输入许可证服务器地址(&S)

source: Enter macro name.
zh_cn: 输入宏的名称。

source: Enter module copy name
zh_cn: 输入模块复制名称

source: Enter new &wildcard ('*' and '?' allowed):
zh_cn: 输入新通配符 (允许 '*' 和 '?' ):(&W)
